app/Livewire/Admin/Fleet/FleetManager.php

    public function totalItems(): int
    {
        return FleetItem::count();
---
select count(*) as `aggregate` from `fleet_items` where `fleet_items`.`deleted_at` is null

    public function activeItems(): int
    {
        return FleetItem::where('is_active', true)->count();
---
select count(*) as `aggregate` from `fleet_items` where `is_active` = 1 and `fleet_items`.`deleted_at` is null

    public function featuredItems(): int
    {
        return FleetItem::where('is_featured', true)->count();
---
select count(*) as `aggregate` from `fleet_items` where `is_featured` = 1 and `fleet_items`.`deleted_at` is null

    public function totalCategories(): int
    {
        return FleetCategory::count();
---
select count(*) as `aggregate` from `fleet_categories` where `fleet_categories`.`deleted_at` is null

    public function render()
    {
        $query = FleetItem::query()->with('category');

        if ($this->search) {
            $query->where(function ($q) {
                $q->where('title', 'like', '%' . $this->search . '%')
                  ->orWhere('description', 'like', '%' . $this->search . '%')
                  ->orWhere('manufacturer', 'like', '%' . $this->search . '%')
                  ->orWhere('model_number', 'like', '%' . $this->search . '%');
            });
        }

        if ($this->filterCategory) {
            $query->where('fleet_category_id', $this->filterCategory);
        }

        if ($this->filterStatus !== '') {
            $query->where('is_active', $this->filterStatus === 'active');
        }

        $query->orderBy($this->sortField, $this->sortDirection);

        $items = $query->paginate($this->perPage);
---
select count(*) as `aggregate` from `fleet_items` where `fleet_items`.`deleted_at` is null