app/Livewire/Admin/OurCompany/OurCompanyManager.php

    private function loadCategories()
    {
        $this->categories = OurCompany::whereNotNull('our_company_category')
            ->where('our_company_category', '!=', '')
            ->distinct()
            ->pluck('our_company_category')
            ->toArray();
---
select distinct `our_company_category` from `our_company` where `our_company_category` is not null and `our_company_category` != ''

    public function edit($id)
    {
        $item = OurCompany::findOrFail($id);
---
select * from `our_company` where `our_company`.`id` = 3 limit 1

    public function toggleStatus($id)
    {
        $item = OurCompany::find($id);
        if ($item) {
            $item->update(['is_active' => !$item->is_active]);
---
select * from `our_company` where `our_company`.`id` = 2 limit 1
update `our_company` set `is_active` = 0, `our_company`.`updated_at` = '2026-07-16 13:29:54' where `id` = 2

    public function totalCompanies(): int
    {
        return OurCompany::count();
---
select count(*) as `aggregate` from `our_company`

    public function activeCompanies(): int
    {
        return OurCompany::where('is_active', true)->count();
---
select count(*) as `aggregate` from `our_company` where `is_active` = 1

    public function render()
    {
        $query = OurCompany::query();

        if ($this->search) {
            $query->where(function ($q) {
                $q->where('oc_title', 'like', '%' . $this->search . '%')
                  ->orWhere('oc_description', 'like', '%' . $this->search . '%')
                  ->orWhere('ceo_name', 'like', '%' . $this->search . '%')
                  ->orWhere('our_company_category', 'like', '%' . $this->search . '%');
            });
        }

        if ($this->filterCategory) {
            $query->where('our_company_category', $this->filterCategory);
        }

        if ($this->filterStatus !== '') {
            $query->where('is_active', $this->filterStatus === 'active');
        }

        $query->orderBy($this->sortField, $this->sortDirection);
        $items = $query->paginate($this->perPage);
---
select count(*) as `aggregate` from `our_company`