app/Livewire/Admin/SEO/SeoDataForm.php

    public function mount($seoId = null)
    {
        $this->loadDropdownData();

        if ($seoId) {
            $seo = $seoId instanceof SeoData ? $seoId : SeoData::find($seoId);
---
select * from `seo_data` where `seo_data`.`id` = '7' limit 1

    protected function loadDropdownData(): void
    {
        $this->services = ServiceDetail::orderBy('sd_title')->get(['id', 'sd_title']);
        $this->productCategories = ProductCategory::where('is_active', true)->orderBy('pc_name')->get(['id', 'pc_name']);
        $this->cities = City::where('is_active', true)->orderBy('name')->get(['id', 'name', 'slug']);
---
select `id`, `sd_title` from `service_detail` order by `sd_title` asc
select `id`, `pc_name` from `product_category` where `is_active` = 1 order by `pc_name` asc
select `id`, `name`, `slug` from `cities` where `is_active` = 1 and `cities`.`deleted_at` is null order by `name` asc