app/Livewire/Admin/SEO/SeoDataList.php

select count(*) as `aggregate` from `seo_data`
select count(*) as `aggregate` from `seo_data` where `seo_no_index` = 0
select count(*) as `aggregate` from `seo_data` where `seo_sitemap_include` = 1
select distinct `seo_page_type` from `seo_data`
---
    public function loadStats()
    {
        $this->totalRecords = SeoData::count();
        $this->indexableRecords = SeoData::where('seo_no_index', false)->count();
        $this->inSitemapRecords = SeoData::where('seo_sitemap_include', true)->count();
        $this->pageTypes = SeoData::distinct()->pluck('seo_page_type')->filter()->values()->toArray();

select * from `seo_data` where `seo_page_type` = 'Home' order by `seo_page_type` asc limit 15 offset 0
select count(*) as `aggregate` from `seo_data` where `seo_page_type` = 'Home'
---
    public function getSeoRecordsProperty()
    {
        return SeoData::query()
            ->when($this->search, function ($q) {
                $q->where(function ($sq) {
                    $sq->where('seo_title', 'like', "%{$this->search}%")
                       ->orWhere('seo_description', 'like', "%{$this->search}%")
                       ->orWhere('seo_page_type', 'like', "%{$this->search}%")
                       ->orWhere('seo_page_url', 'like', "%{$this->search}%")
                       ->orWhere('seo_keywords', 'like', "%{$this->search}%");
                });
            })
            ->when($this->pageTypeFilter !== '', function ($q) {
                $q->where('seo_page_type', $this->pageTypeFilter);
            })
            ->when($this->indexFilter !== '', function ($q) {
                $q->where('seo_no_index', $this->indexFilter === 'noindex');
            })
            ->when($this->sitemapFilter !== '', function ($q) {
                $q->where('seo_sitemap_include', (bool) $this->sitemapFilter);
            })
            ->orderBy($this->sortField, $this->sortDirection)
            ->paginate($this->perPage);