app/Livewire/Admin/Services/ServiceList.php

select * from `our_service` where `our_service`.`id` = 7 limit 1
---
    public function viewServiceDetails($id) { $this->viewService = Service::with('serviceDetails','serviceAdvantages')->find($id); $this->showViewModal = true; }

select count(*) as `aggregate` from `our_service`
---
    public function getServicesProperty()
    {
        return Service::query()
            ->when($this->search, fn($q) => $q->where(fn($sq) => $sq->where('os_name','like',"%{$this->search}%")->orWhere('os_description','like',"%{$this->search}%")))
            ->when($this->statusFilter !== '', fn($q) => $q->where('is_active', (int) $this->statusFilter))
            ->when($this->featuredFilter !== '', fn($q) => $q->where('is_featured', (int) $this->featuredFilter))
            ->orderBy($this->sortField, $this->sortDirection)
            ->paginate($this->perPage);