app/Livewire/Admin/Services/ServiceAdvantageForm.php

select * from `service_advantage` where `service_advantage`.`id` = 4 limit 1
---
    public function save()
    {
        $rules = [
            'sa_st_id' => 'required|exists:our_service,id',
            'sa_title' => 'required|string|max:255',
        ];

        if ($this->sa_image) $rules['sa_image'] = 'image|mimes:jpeg,png,jpg,webp|max:5120';

        $this->validate($rules);
        $this->isSaving = true;

        try {
            $adv = $this->isEditing ? ServiceAdvantage::findOrFail($this->advantageId) : new ServiceAdvantage();