app/Livewire/Admin/Services/ServiceDetailForm.php

select * from `service_detail` where `service_detail`.`id` = '16' limit 1
---
    public function mount($detailId = null, $serviceId = null)
    {
        $this->services = Service::active()->orderBy('os_name')->get();

        if ($serviceId) $this->os_id = $serviceId;

        if ($detailId) {
            $detail = ServiceDetail::find($detailId);