app/Livewire/Admin/Contact/ContactMessageList.php

    public function mount()
    {
        $this->loadStats();
        $this->cities = ContactMessage::getCities();
        $this->services = Service::active()->orderBy('os_name')->get();
        $this->users = User::orderBy('name')->get();
---
select * from `users` order by `name` asc

    public function getMessagesProperty()
    {
        return ContactMessage::query()
            ->with(['service', 'assignedTo'])
            ->when($this->search, fn($q) => $q->where(fn($sq) => $sq
                ->where('cm_name', 'like', "%{$this->search}%")
                ->orWhere('cm_email', 'like', "%{$this->search}%")
                ->orWhere('cm_phone', 'like', "%{$this->search}%")
                ->orWhere('cm_subject', 'like', "%{$this->search}%")
                ->orWhere('cm_message', 'like', "%{$this->search}%")
                ->orWhere('cm_company', 'like', "%{$this->search}%")
                ->orWhere('cm_city', 'like', "%{$this->search}%")
            ))
            ->when($this->statusFilter !== '', fn($q) => $q->where('cm_status', $this->statusFilter))
            ->when($this->priorityFilter !== '', fn($q) => $q->where('cm_priority', $this->priorityFilter))
            ->when($this->sourceFilter !== '', fn($q) => $q->where('cm_source', $this->sourceFilter))
            ->when($this->cityFilter !== '', fn($q) => $q->where('cm_city', $this->cityFilter))
            ->when($this->dateFilter === 'today', fn($q) => $q->today())
            ->when($this->dateFilter === 'week', fn($q) => $q->thisWeek())
            ->orderByRaw("FIELD(cm_priority, 'urgent', 'high', 'medium', 'low')")
            ->orderBy($this->sortField, $this->sortDirection)
            ->paginate($this->perPage);
---
select count(*) as `aggregate` from `contact_messages` where `contact_messages`.`deleted_at` is null