app/Models/ContactMessage.php

select count(*) as `aggregate` from `contact_messages` where `contact_messages`.`deleted_at` is null
---
    public static function getTotalMessages(): int
    {
        return self::count();

select count(*) as `aggregate` from `contact_messages` where date(`created_at`) = '2026-07-14' and `contact_messages`.`deleted_at` is null
---
    public static function getTodayMessages(): int
    {
        return self::today()->count();

select distinct `cm_city` from `contact_messages` where `cm_city` is not null and `contact_messages`.`deleted_at` is null
---
    public static function getCities(): array
    {
        return self::distinct()->whereNotNull('cm_city')->pluck('cm_city')->filter()->toArray();