app/Models/SeoData.php

    public static function getSeo(string $pageType, ?string $slug = null, ?string $citySlug = null): self
    {
        $query = self::where('is_active', 1)->where('seo_page_type', $pageType);

        if ($slug) {
            $query->whereRaw('LOWER(seo_slug) = ?', [strtolower($slug)]);
        }

        $seo = $query->first();
---
select * from `seo_data` where `is_active` = 1 and `seo_page_type` = 'home' limit 1