app/Models/Service.php

    public static function getTotalServices(): int
    {
        return self::count();
---
select count(*) as `aggregate` from `our_service`

    public static function getActiveServices(): int
    {
        return self::active()->count();
---
select count(*) as `aggregate` from `our_service`