app/Models/Setting.php

    public static function getCached(): self
    {
        return static::query()->first() ?? new static();
---
select * from `settings` limit 1