app/Livewire/Website/ContactPage.php

select * from `seo_data` where `seo_page_type` = 'Contact' limit 1
select * from `contact_us` limit 1
select * from `contact_address` where `is_active` = 1 and `show_on_website` = 1
---
    public function mount()
    {
        try {
            $this->isLoading = true;

            $this->initializeSEO('contact');

            $this->seo = SeoData::where('seo_page_type', 'Contact')->first();
            $this->contact = ContactUs::first();
            $this->contactAddresses = ContactAddress::where('is_active', 1)
                ->where('show_on_website', 1)
                ->get();