app/Livewire/Website/HomePage.php

select * from `our_service` where `our_service`.`id` in (8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19)
select * from `service_detail`
select * from `fleet_categories` where `fleet_categories`.`id` in (1, 2, 3, 4, 5, 6, 7) and `fleet_categories`.`deleted_at` is null
---
    public function render()
    {
        $slider = Slider::active()->ordered()->get();
        $services = Service::active()->ordered()->get();
        $com = Company::active()->first();
        $os = Service::active()->get();
        $sd = ServiceDetail::with('service')->get();
        $pro = Project::active()->latest()->get();
        $pc = ProductCategory::active()->get();

        // Fleet Data - Dynamic
        $fleetCategories = FleetCategory::active()->ordered()->with(['activeFleetItems' => function($query) {
            $query->ordered();
        }])->get();