app/Livewire/Website/HomePage.php

    public function render()
    {
        $slider = Slider::active()->ordered()->get();
        $services = Service::active()->ordered()->get();
        $seo = SeoData::where('seo_page_type', 'Home')->first();
---
select * from `seo_data` where `seo_page_type` = 'Home' limit 1