app/Livewire/Website/ProductsPage.php

    public function mount($pc_slug = null)
    {
        $this->isLoading = true;

        try {
            $this->initializeSEO('products');
            $this->pc_slug = $pc_slug;

            $this->seo        = SeoData::where('seo_page_type', 'product')->first();
---
select * from `seo_data` where `seo_page_type` = 'product' limit 1

    private function fetchProducts()
    {
        $query = Product::active();

        // ----- Search -----
        if (!empty($this->search)) {
            $term = $this->search;
            $query->where(function ($q) use ($term) {
                $q->where('p_name', 'like', "%{$term}%")
                  ->orWhere('p_description', 'like', "%{$term}%")
                  ->orWhere('p_short_description', 'like', "%{$term}%")
                  ->orWhere('brand_name', 'like', "%{$term}%")
                  ->orWhere('pc_type', 'like', "%{$term}%");
            });
        }

        // ----- Category filter -----
        if ($this->selectedCategory !== 'all') {
            $catId = $this->selectedCategory;

            $category = ProductCategory::find($catId);
---
select * from `product_category` where `product_category`.`id` = '' limit 1