app/Livewire/Website/ServicesPage.php

    public function mount()
    {
        try {
            $this->isLoading = true;

            $this->initializeSEO('services');

            $this->seo = SeoData::where('seo_page_type', 'Service')->first();
---
select * from `seo_data` where `seo_page_type` = 'Service' limit 1