app/Livewire/Website/ServiceDetailPage.php

select * from `service_detail` where `id` = 5 or `os_id` = 5 limit 1
select * from `service_advantage` where `sa_st_id` = 5 order by `sort_order` asc
select `pc_name` from `product_category` where `is_active` = 1
select * from `seo_data` where `seo_page_type` = 'concrete-drilling-steel-epoxy-rebar-grouting' limit 1
---
    public function render()
    {
        $services = Service::active()->ordered()->get();

        // Dhyaan dein: service_id ya os_id foreign key check karein (Aapki DB field ke mutabiq name adjust kar sakte hain)
        $currentDetail = ServiceDetail::where('id', $this->activeTab)
            ->orWhere('os_id', $this->activeTab)
            ->first();

        // Agar directly match na ho to fallback check lagayein
        if (!$currentDetail && $this->activeTab) {
            $currentDetail = ServiceDetail::where('id', $this->activeTab)->first();
        }

        $currentAdvantages = [];
        if ($currentDetail) {
            $currentAdvantages = ServiceAdvantage::where('sa_st_id', $currentDetail->id)
                ->orderBy('sort_order')
                ->get();
        }

        $seo = $this->getSeoData();

        return view('livewire.website.service-detail-page', [
            'services' => $services,
            'currentDetail' => $currentDetail,
            'currentAdvantages' => $currentAdvantages,
            'pdffile' => PdfFile::active()->first(),
            'seo' => SeoData::where('seo_page_type', $this->serviceName ?? 'Service_detail')->first(),
            'pc' => ProductCategory::active()->select('pc_name')->get(),
        ])->layoutData(['seo' => $seo]);